## Staging: performance-test
**✅ &nbsp; Terraform Format:** `success`
**✅ &nbsp; Terraform Plan:** `success`




**⚠️ &nbsp; WARNING:** resources will be destroyed by this change!


```terraform
Plan: 2 to add, 0 to change, 2 to destroy
```


<details>
<summary>Show plan</summary>

```terraform
Resource actions are indicated with the following symbols:
  + create
  - destroy

Terraform will perform the following actions:

  # aws_iam_policy.perf_test_ecs_task_get_secret_value will be destroyed
  - resource "aws_iam_policy" "perf_test_ecs_task_get_secret_value" {
      - arn       = "arn:aws:iam::239043911459:policy/PerfTestEcsTaskGetSecretValue" -> null
      - id        = "arn:aws:iam::239043911459:policy/PerfTestEcsTaskGetSecretValue" -> null
      - name      = "PerfTestEcsTaskGetSecretValue" -> null
      - path      = "/" -> null
      - policy    = jsonencode(
            {
              - Statement = [
                  - {
                      - Action   = "secretsmanager:GetSecretValue"
                      - Effect   = "Allow"
                      - Resource = [
                          - "arn:aws:secretsmanager:ca-central-1:239043911459:secret:perf_test_phone_number-DWkOGY",
                          - "arn:aws:secretsmanager:ca-central-1:239043911459:secret:perf_test_email-sWnA9Z",
                          - "arn:aws:secretsmanager:ca-central-1:239043911459:secret:perf_test_domain-WSUpwW",
                          - "arn:aws:secretsmanager:ca-central-1:239043911459:secret:perf_test_auth_header-PxFUOL",
                        ]
                      - Sid      = ""
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> null
      - policy_id = "ANPATPKBAT4RXKJVRYAOS" -> null
      - tags      = {} -> null
      - tags_all  = {} -> null
    }

  # aws_iam_policy.perf_test_secretsmanager will be created
  + resource "aws_iam_policy" "perf_test_secretsmanager" {
      + arn       = (known after apply)
      + id        = (known after apply)
      + name      = "PerfTestEcsTaskGetSecretValue"
      + path      = "/"
      + policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = "secretsmanager:GetSecretValue"
                      + Effect   = "Allow"
                      + Resource = [
                          + "arn:aws:secretsmanager:ca-central-1:239043911459:secret:perf_test_phone_number-DWkOGY",
                          + "arn:aws:secretsmanager:ca-central-1:239043911459:secret:perf_test_email-sWnA9Z",
                          + "arn:aws:secretsmanager:ca-central-1:239043911459:secret:perf_test_domain-WSUpwW",
                          + "arn:aws:secretsmanager:ca-central-1:239043911459:secret:perf_test_auth_header-PxFUOL",
                        ]
                      + Sid      = ""
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + policy_id = (known after apply)
      + tags_all  = (known after apply)
    }

  # aws_iam_role_policy_attachment.perf_test_ecs_task_get_secret_value_policy_attach will be destroyed
  - resource "aws_iam_role_policy_attachment" "perf_test_ecs_task_get_secret_value_policy_attach" {
      - id         = "performance_test_cluster-ecs-task-20211129182102652200000001" -> null
      - policy_arn = "arn:aws:iam::239043911459:policy/PerfTestEcsTaskGetSecretValue" -> null
      - role       = "performance_test_cluster-ecs-task" -> null
    }

  # aws_iam_role_policy_attachment.perf_test_secretsmanager will be created
  + resource "aws_iam_role_policy_attachment" "perf_test_secretsmanager" {
      + id         = (known after apply)
      + policy_arn = (known after apply)
      + role       = "container_execution_role"
    }

Plan: 2 to add, 0 to change, 2 to destroy.

------------------------------------------------------------------------

This plan was saved to: plan.tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "plan.tfplan"

Releasing state lock. This may take a few moments...

```

</details>